---
layout: post
title:  "3. Gün"
categories: main
tags: running-config startup-config enable-mode user-mode conf-mode reload history
---

* Switch komut satırına erişimi sağlamak kullanılan metodlar:
    * Konsol kablosuyla cihazın yanından erişim sağlamak.
    * Telnet ve SSH ile uzaktan erişim sağlanmak.

* Konsol bağlantısı için kablolama ayarları.
* Bir Cisco Switch'in default konsol port ayarları
* User, Enable ve Global config modları arasında navigasyon.
* conf mode içerisinde context-setting komutları (line, interface, vlan)

* Switch veya Router üzerindeki iki konfürasyon dosyasının adları ve amaçları

```
startup-config - nvram'da saklanır. Cihaz açıldığında RAM'e kopyalanır.
                 
running-config - ram'de durur. Çalışan konfigürasyonu gösterir.
                 Bu dosya conf mod'da komut girildikçe değişir.
```


* Aşağıda cihazın `enable-mode`'a geçirilmesi `start-config`'in silinmesi ve baştan başlatılması gösteriliyor.
Bu cihazı sıfırlamak, format atmak anlamına gelir.

```
enable
erase start-config 
reload
```

* Bir cisco cihazda aşağıdaki hafıza birimleri bulunur:

```
Flash  - Cisco IOS Yazılımı
RAM    - Çalışan Hafıza ve Running Configuration
ROM    - Bootstrap Programı
NVRAM  - Startup Configuration
```

* `config` dosyaların yedeklerinin sürekli alınması gerekmektedir.
* Cihazda iki tane `config dosyası` bulunur.

```
  running-config - (ram'de durur. Çalışan konfigürasyonu gösterir.)
  startup-config - (nvram'da saklanır. Cihaz açıldığında RAM'e kopyalanır.)
```

* Cihaz açılırkan NVRAM içerisindeki startup-config içerisinden alınarak running-config'e işlenir.

* 3 farklı yönetim modu :
  * USER MODE : Konfigürasyon 
  * ENABLE MODE : Ara kademe yönetim modu. Kısmi olarak konfürasyon. show ile çıktı raporlar alınır. (Priviledge mode)
  * CONFIGURE MODE : Global Mode, konfigürasyonların yapıldığı esas moddur.
  
* `?` en önemli komut. Bu komut ile gerekli komutları öğrenebilirsiniz.
* `t?` t ile başlayan komutlar.

* Cihaza ip üzerinden eriştiyseniz sizi karşılayan mod enable mod'dur.
* `reload` yapıldığı anda mevcut konfigürasyon kaybolur.
* `copy run start` ramdaki konfigürasyonu startup config adında.
* Unutmamanız gereken bir komut da 'show' bu komutu hem user modda hem de enable modda kullanabilirsiniz.
```
show history
show version
show startup-config
show users
show vlan
```
 * `Birinci aşama : hostname`
 * `İkinci aşama : ip adresi`
 * MAC adresi değişmez (Media Access Control)
 * Switch kendisine bağlı bütün cihazların MAC adresini biliyor.
 * Switch'e ip adresi atanır. Uzaktan ulaşım ve konfigürasyon için.
 * Bilgi güvenliği ve sanallaştırma uzmanlık edinmeniz gereken alanlardır.
 * `show vlan`
 * Fa0/3  için notasyon = `Fa < modul numarası > / < port numarası >`
 * Switch portlar vlan'lar olarak gruplandırılır.
 * Switch'in hiçbir portuna ip adresi verilemez. Sadece vlan'a ip adresi verilebilir.
 * Cihazı ilk aldığınız zaman IOS size sadece bir default vlan sunar. Bunun da numarası 1'dir.
 * `show interfaces`
 * switch'in her bir portunun mac adresi ayrıdır.
 * `show ip interface brief` komutuyla portlar kontrol edilir.

```
Kat1#show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
 
FastEthernet0/1        unassigned      YES manual up                    up
FastEthernet0/2        unassigned      YES manual up                    up
FastEthernet0/3        unassigned      YES manual down                  down
FastEthernet0/4        unassigned      YES manual down                  down
FastEthernet0/5        unassigned      YES manual down                  down
FastEthernet0/6        unassigned      YES manual down                  down
FastEthernet0/7        unassigned      YES manual down                  down
FastEthernet0/8        unassigned      YES manual down                  down
FastEthernet0/9        unassigned      YES manual down                  down
FastEthernet0/10       unassigned      YES manual down                  down
FastEthernet0/11       unassigned      YES manual down                  down
FastEthernet0/12       unassigned      YES manual down                  down
FastEthernet0/13       unassigned      YES manual down                  down
FastEthernet0/14       unassigned      YES manual down                  down
FastEthernet0/15       unassigned      YES manual down                  down
FastEthernet0/16       unassigned      YES manual down                  down
FastEthernet0/17       unassigned      YES manual down                  down
FastEthernet0/18       unassigned      YES manual down                  down
FastEthernet0/19       unassigned      YES manual down                  down
FastEthernet0/20       unassigned      YES manual down                  down
FastEthernet0/21       unassigned      YES manual down                  down
FastEthernet0/22       unassigned      YES manual down                  down
FastEthernet0/23       unassigned      YES manual down                  down
FastEthernet0/24       unassigned      YES manual down                  down
Vlan1                  unassigned      YES manual administratively down down
```

* ip adresi verirken interface'in içerisinde olmanız lazım.
* `vlan1` default olarak down'dur. `no sh` ile açılması gerekir.

```
Kat1(config)#interface vlan1
Kat1(config-if)#interface vlan 1
Kat1(config-if)#shutdown
Kat1(config-if)#?
Interface configuration commands:
  arp          Set arp type (arpa, probe, snap) or timeout
  description  Interface specific description
  exit         Exit from interface configuration mode
  ip           Interface Internet Protocol config commands
  no           Negate a command or set its defaults
  shutdown     Shutdown the selected interface
  standby      HSRP interface configuration commands
Kat1(config-if)#no shutdown

Kat1(config-if)#
%LINK-5-CHANGED: Interface Vlan1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
```

* Şimdi ip adresi vereceğiz. 

```
Kat1(config-if)#ip address 192.168.1.254 255.255.255.0
```

* Ping atıldığında ilki `timeout` oluyor.
* Bunun nedeni switch'in MAC tablosuna ekleme yapmakla meşgul olmasıdır.

```
PC>ping 192.168.1.254

Pinging 192.168.1.254 with 32 bytes of data:

Request timed out.
Reply from 192.168.1.254: bytes=32 time=2ms TTL=255
Reply from 192.168.1.254: bytes=32 time=0ms TTL=255
Reply from 192.168.1.254: bytes=32 time=0ms TTL=255

```

* Şimdi switch içerisinden router'ı pingleyebiliyoruz.

```
Kat1>en
Kat1#ping 192.168.1.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.1, timeout is 2 seconds:
!!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 0/0/0 ms

```

Buradaki işaretler anlam taşır.

```
!!!! - 
.... - request timeout
uuuu - unreachable
```

* `conf mod`a erişilememesi için önünde bulunan enable moda şifre konulmalıdır.

```
Kat1(config)#enable ?
  password  Assign the privileged level password
  secret    Assign the privileged level secret
```

```
Kat1(config)#enable password Password1
Kat1(config)#exit
``` 

```
Kat1>en
Kat1>enable
Password:
Kat1#
```

* Burada verilen şifre config dosyalarında açık saklanır.
* Şu anda hostname, VLAN IP ve password konfigürasyonu var.

```
copy run start
```

* Switch tarafında hedef bir mac adresi tablosu, iki config dosyaları.

```
Kat1(config)#enable secret Abcd1
```

* Burada verdiğimiz şifre gördüğümüz gibi şifreli olarak saklanır.

```
hostname Kat1
!
enable secret 5 $1$mERr$KW7MI922oOt.9AveRpIf90
enable password Password1
!
!
```

* İkisi arasında daha güçlü olan `secret` geçerlidir.
* Uygulama yapıldı. !!!!!!!!!!!!!!!!!!!!!!
* Network tasarımı için alternatif araçlar mevcuttur. Örneğin `Visio`'da tasarım yapılabilir.
* Metro etherneti fiber olarak kısaltıldı. ?
* Slayt gösterildi.
