---
layout: post
title:  "13. Gün"
categories: main
tags: packet-tracer-proje server dhcp-relay access-control-list telnet
---

* Bugünkü proje ilerleyen konularınıza referans özelliği taşıdığı için dikkat edilmesi gerekiyor.
* DMZ – DEMILITARIZED ZONE
* Erişim kısıtlaması yapacağız.
* Serverların ip'si asla dinamik olmaz her zaman statik verilir. Çünkü server ip çözümleme ile zaman kaybetmemelidir.

```
=====================
R1
=====================
en
conf t
hostname R1

int fa0/0
no sh
ip add 192.168.100.1 255.255.255.224

int fa0/1
no sh
ip add 192.168.100.33 255.255.255.224

int se0/0/0
ip add 1.1.1.1 255.255.255.252
no sh

exit

router ospf 1
network 1.1.1.0 0.0.0.3 area 0
network 192.168.100.0  0.0.0.31 area 0
network 192.168.100.32 0.0.0.31 area 0
=====================
R2
=====================
en
conf t
hostname R2

int fa0/0
no sh
ip add 192.168.100.97 255.255.255.224

int fa0/1
no sh
ip add 192.168.100.65 255.255.255.224

int se0/0/0
ip add 1.1.1.2 255.255.255.252
no sh

exit

router ospf 1
network 1.1.1.0 0.0.0.3 area 0
network 192.168.100.64  0.0.0.31 area 0
network 192.168.100.96 0.0.0.31 area 0
```

* Routerlar hiçbir zaman broadcast mesajlarını geçirmezler.
* Geldiği interface'de durdurur.
* Bu nedenle bu yapıda ip alınamaz.

#### DHCP Relay

* Gelen broadcast mesajları router'da unicast olarak yönlendirebiliriz. `relay`
* Bu yine relay'in ilkel halidir. Bunun daha sofistike olanı serverda gerçekleşir.
* Gelen broadcast mesajları router'da unicast olarak yönlendirir.
* DHCP serverdan gelen ip bilgilerini de tekrar client'a yönlendirir.
* DHCP serverının ip adresini veriyoruz. 

```
=====================
R1
=====================
en
conf t

int fa 0/0
ip helper-address 192.168.100.2


int fa 0/1
ip helper-address 192.168.100.2
=====================
R2
=====================
en
conf t

int fa 0/0
ip helper-address 192.168.100.2


int fa 0/1
ip helper-address 192.168.100.2

```

* DNS içerisinde üç tip kayıt:
  * NS Record
  * A Record
  * CNAME Record

* DNS için A kaydı önemlidir.
* Serverların hepsinin A kaydı girildi.
* Packet Tracer üzerinden mail atıldı.
* Gelen mail için POP3 protokolü kullanılır. (TCP 110)
* Giden mail için smtp protokolü kullanılır. (TCP 25/587) Türkiye'de kapalı bu port.

## Access Control List

```
1. kat1 ve kat3 haberleşemesin.
2. volkan web ve ftp'ye erişemesin
```

* !!!!! Konu Anlatımı ACL

* Üç yöntem uygulanır.
 * standart ACL  - kat1 ve kat3 haberleşemesin
 * extended ACL
 * named ACL  
 
* Listeler birbiri ile çakışabilir.
* Cisco'da ACL, Microsoft işletim sisteminde policy olarak karşımıza çıkar. Cisco dışında da `rule` olarak karşımıza çıkabilir.
Platforma bağlı yalnızca ismi değişir.

```
in        out
===> | R | ===>
f0/0       fa0/1
```

* Paketin router'a giriş ve çıkış yönü çok önemlidir.
* İlk adımda ACL oluşturulur. Ardından bir interface'e teslim edilir. Ya geliş ya da çıkış tarafından olabilir.
* Bu bir saldırı paketiyse bazen dışarıda bazen içeride durdurulur.
* standart mı extended mi olacağı bir numara ile belli olur. Birden fazla liste olabilir.
* 1-99 standart
* 100-199 extended
* Dikkat edilecek noktalar [slayttan]
* Named'da değişiklik yapabilirken ötekilerde silmek zorundayız.
* Bir router üzerinde ACL kullanıldıysa trafikte bir yavaşlama olur. 
### Komutlar

* Access Listler oluşturulurken Subnet Mask yerine Wild Card Mask denilen ve Subnet Maskın 255’e tamamlanmasıyla elde edlien maske kullanılır. 

````
Örnek:
192.168.100.32 0.0.0.31 (Network'ü engellerken.)
=============  
^Network id

192 168.100.34 0.0.0.0 (Host'u engellerken. )


// Ya da basitçe bu gösterim tercih edilir.
host 192.168.100.34 

Örnek2:
255.255.128.0 subnet maskının wildcard maskı 0.0.127.255 olacaktır.

Tek bir host belirtmek için kullanılacak:

Ip adresi: 192.168.1.2
Wild-Card Mask: 0.0.0.0

````

* Aşağıda `access-list` yazılmış. Bir ip engellenmiş. Daha sonra interface'e bağlanmış.

```
Router(config)#access-list 1 deny 192.168.1.100 0.0.0.0
Router(config)#access-list 1 permit any
Router(config)#interface Ethernet 0/0
Router(config-if)#ip Access-group 1 in
```

* Standartta sadece kaynak adres iken, extended'da hedef, protokol vs. kullanılabilir.
* named ile access listlere isim verebiliyoruz.
* access listleri uygularken access-list komutuyla başlayabileceğiniz gibi ip access-list komutu ile de başlayabilirsiniz.
* `ip access-list` named'da tercih edilir.

* Hangi router'a uygulayacağız? Probleme göre:

```
1. kat1 ve kat3 haberleşemesin.
2. volkan web ve ftp'ye erişemesin
```


* `Standart -> hedefe yakın. Extended -> kaynağa yakın.`  R2
* Hangi interface'e uygulayacağız? in mi out mu? Bunu belirlemek önemlidir.
* `fa0/0 out` olacak.
* Yanlış verilirse `çıkanları sokma` demek gibi bir şey olur.

```
=================
R2
=================
en
conf t
access-list 63 remark Kat1'in Kat3'e erisimini engelle
access-list 63 deny 192.168.100.32 0.0.0.31
access-list 63 permit any
int fa0/0
ip access-group 63 out
```
* `192.168.100.32` network'ü dışarısında kalan herkese izin verildi.
* `1. şart` sağlanmış oldu.
* R1 - extended olduğu için 

```
===============================
R1
===============================

R1>en
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#access-list 105 deny ?
  ahp    Authentication Header Protocol
  eigrp  Cisco's EIGRP routing protocol
  esp    Encapsulation Security Payload
  gre    Cisco's GRE tunneling
  icmp   Internet Control Message Protocol
  ip     Any Internet Protocol
  ospf   OSPF routing protocol
  tcp    Transmission Control Protocol
  udp    User Datagram Protocol
R1(config)#access-list ?
  <1-99>     IP standard access list
  <100-199>  IP extended access list
R1(config)#access-list 105 deny host 192.168.100.34 host 192.168.100.3  ?
% Unrecognized command
R1(config)#access-list 105 deny tcp host 192.168.100.34 host 192.168.100.3 ?
  dscp         Match packets with given dscp value
  eq           Match only packets on a given port number
  established  established
  gt           Match only packets with a greater port number
  lt           Match only packets with a lower port number
  neq          Match only packets not on a given port number
  precedence   Match packets with given precedence value
  range        Match only packets in the range of port numbers
  <cr>
R1(config)#access-list 105 deny tcp host 192.168.100.34 host 192.168.100.3 eq 80
R1(config)#access-list 105 deny tcp host 192.168.100.34 host 192.168.100.3 eq 443
R1(config)#access-list 105 deny tcp host 192.168.100.34 host 192.168.100.3 eq 21
R1(config)#access-list 105 permit ospf any any
R1(config)#access-list 105 permit ip any any
R1(config)#access-list 105 permit tcp any any eq 80
R1(config)#access-list 105 permit tcp any any eq 443
R1(config)#access-list 105 permit tcp any any eq 21
R1(config)#access-list 105 permit tcp any any eq 22
R1(config)#access-list 105 permit tcp any any eq 23
R1(config)#access-list 105 permit tcp any any eq 53
R1(config)#access-list 105 permit tcp any any eq 110
R1(config)#access-list 105 permit tcp any any eq 25
R1(config)#access-list 105 permit udp any any eq 67
R1(config)#access-list 105 permit udp any any eq 68

R1(config)#do sh access-list
Extended IP access list 105
    10 deny tcp host 192.168.100.34 host 192.168.100.3 eq www
    20 deny tcp host 192.168.100.34 host 192.168.100.3 eq 443
    30 deny tcp host 192.168.100.34 host 192.168.100.3 eq ftp
    40 permit ospf any any
    50 permit ip any any
    60 permit tcp any any eq www
    70 permit tcp any any eq 443
    80 permit tcp any any eq ftp
    90 permit tcp any any eq 22
    100 permit tcp any any eq telnet
    110 permit tcp any any eq domain
    120 permit tcp any any eq pop3
    130 permit tcp any any eq smtp
    140 permit udp any any eq bootps
    150 permit udp any any eq bootpc

```

* 3. kural Hamza ftp ve tfpye erişemesin.

```
access-list 110 deny udp host 192.168.100.66 host 192.168.100.3 eq tftp
access-list 110 deny tcp host 192.168.100.66 host 192.168.100.3 eq ftp
access-list 110 permit ospf any any
access-list 110 permit ip any any
access-list 110 permit tcp any any eq www
access-list 110 permit tcp any any eq 443
access-list 110 permit tcp any any eq ftp
access-list 110 permit tcp any any eq 22
access-list 110 permit tcp any any eq telnet
access-list 110 permit tcp any any eq domain
access-list 110 permit tcp any any eq pop3
access-list 110 permit tcp any any eq smtp
access-list 110 permit udp any any eq bootps
access-list 110 permit udp any any eq bootpc
access-list 110 permit udp any any eq tftp

```

## Telnet

* Enable moda şifre verilir. (password/secret)

```
en
conf t
enable secret 123
```

* Bir kullanıcı oluşturulur. Yönetim yetkileri verilir.

```
username kullanici privilage 15 secret 456
```
* `15` maksimum yetki seviyesidir.
* Telnet erişimi için sanal bağlantı açılır.
* Kimik denetimi yönetimini ayarlanır.

```
line vty 0 5
 login local
```

* Kaç bağlantı olacak ? Burası için `6`

```
en
conf t
enable secret 123
username kullanici privilage 15 secret 456

```

* vty ile hattı aç.

```
line vty 0 1
login local

```

* telnet hızlı fakat güvensiz bir erişimdir.

* Router'lara loopback ip vermemizin bir sebebi de bu ipnin gerçek ipsini gizlemesidir. Bu adrese telnet, ssh bağlantısı yapılabilir.
